Documents/ЗаявкаНаПродажуОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПродажуОпционов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОпционовДляПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РеализацияОпционов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадрыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаПродажуОпционов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиентеПроцедура ПродажаОпционовКоманда(Команда)  	
    ПродажаОпционов(ЭтотОбъект.Объект.ПакетОпционов, ЭтотОбъект.Объект.Дата); 
КонецПроцедуры

Процедура ПродажаОпционов(ПакетыОпционов, Дата)          Если ЭтотОбъект.Объект.КоличествоОпционовДляПродажи > ЭтотОбъект.Объект.ДоступныеОпционы Тогда        Сообщить("Ошибка: Количество опционов для продажи не может превышать доступные опционы!");        Отказ = Истина;          Возврат;	КонецЕсли; 
	
	ЗаписатьДок = Записать();  // запись текущего документа    
	// создание нового документа реализации	    Реализация = Документы.РеализацияОпционов.СоздатьДокумент();    Реализация.ПакетОпционов = ЭтотОбъект.Объект.ПакетОпционов;    
	Реализация.ДоступныеОпционы = ЭтотОбъект.Объект.ДоступныеОпционы;    Реализация.Количество = ЭтотОбъект.Объект.КоличествоОпционовДляПродажи;    Реализация.Дата = ЭтотОбъект.Объект.Дата;  
	Реализация.НомерЗаявки = ЭтотОбъект.Объект.Номер;
	Реализация.Статус = ЭтотОбъект.Объект.Статус;    Реализация.Записать();
	
	    Сообщить("Заявка на продажу опционов отправлена. Номер заявки " + ЭтотОбъект.Объект.Номер);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПолучениеДоступныхОпционовКоманда(Команда)
	 ПолучениеДоступныхОпционов(ЭтотОбъект.Объект.ПакетОпционов)
КонецПроцедуры   

Процедура ПолучениеДоступныхОпционов(ПакетыОпционов)
	ОбъектПакета = ПакетыОпционов.ПолучитьОбъект(); // получение текущего пакета опционов
	ЭтотОбъект.Объект.ДоступныеОпционы = ПакетыОпционов.ОстатокОпционов;
КонецПроцедуры
